package homework26;

public class Quiz {
    /*
    с помощью какого механизма мы можем избежать дублирования в двух разных классах?
    -наследования
    С помощью какого ключевого слова мы наследуемся
    -extends

    A extends B где потомок,а где предок?
    В- предок
    А- потомок

    С помощью какого модификатора можно сделать так,чтобы метод или поле были доступны в потомке?
    - protected
    - public

    Какие элементы класса предка(родителя) копируются в класс потомок?
    -поля
    -методы
    -НЕ копируются конструкторы

    Как принудительно вызвать конструктор предка в конструкторе потомка
    -super()

    Что будет,если в конструкторе потомка не вызвать явно конструктор предка?
    -Java опытается пустой конструктор предка (super())
    -А если конструктора нет,будет ошибка компеляции - программа не запуститься

     */
}
